; domain
(define (domain drone-dom)

    (:requirements
        :strips :typing
    )

    (:types
        drone human box content location carrier num
    )

    (:predicates
        (drone-at ?d - drone ?l - location) 
        (drone-free ?d - drone)
        (drone-carry-box ?d - drone ?b - box)
        ;(drone-carry-carrier ?d - drone ?c - carrier)
        (human-at ?h - human ?l - location)
        (human-has ?h - human ?c - content)
        (box-at ?b - box ?l - location)
        (box-has ?b - box ?c - content)
        (box-free ?b - box)
        (carrier-at ?c - carrier ?l - location)
        (carrier-has-box ?c ?b)
        (next ?n1 ?n2 - num)
        (carrier-n-boxes ?c - carrier ?n - num)
    )

    (:action move-carrier
        :parameters (?d - drone ?to ?from - location ?c - carrier)
        :precondition (and
            (drone-free ?d)
            (drone-at ?d ?from)
            (carrier-at ?c ?from)
        )
        :effect (and
            (not(carrier-at ?c ?from)); el carrier deja de estar en la localización
            (not(drone-at ?d ?from))
            (carrier-at ?c ?to)
            (drone-at ?d ?to)
        )
    )

    (:action move
       :parameters (?d - drone ?from ?to - location)
       :precondition (and 
           (drone-at ?d ?from)
       )
       :effect (and
           (drone-at ?d ?to) 
           (not (drone-at ?d ?from))
       )
    )

    (:action put-box-on-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;debe estar bajado el carrier
            (drone-carry-box ?d ?b) ;el dron tiene que tener la caja (haber hecho pick-up)
            (next ?n1 ?n2) ;no ha llegado al limite de capacidad
            (carrier-n-boxes ?c ?n1)
        )
        :effect (and
            (drone-free ?d)
            (not (drone-carry-box ?d ?b)) ;el dron deja de tener la caja
            (carrier-has-box ?c ?b) ;para tenerla el carrier
            (not (carrier-n-boxes ?c ?n1))
            (carrier-n-boxes ?c ?n2)
        )
    )
    
    (:action pick-up
        :parameters (?d - drone ?b - box ?c - content ?l - location)
        :precondition (and 
            (drone-at ?d ?l)
            (box-at ?b ?l)
            (drone-free ?d)
            (box-has ?b ?c)
            (box-free ?b)
        )
        :effect (and
            (drone-carry-box ?d ?b)
            (not (drone-free ?d))
            (not (box-at ?b ?l))
        )
    )

    (:action take-off-box-carrier
        :parameters (?d - drone ?b - box ?l - location ?c - carrier ?n1 ?n2 - num)
        :precondition (and 
            (drone-at ?d ?l)
            (carrier-at ?c ?l) ;el carrier y el dron deben estar en el mismo sitio
            (carrier-has-box ?c ?b) ;la caja a coger la tiene que tener el carrier
            (drone-free ?d) ;el dron tiene que estar vacio
            (carrier-n-boxes ?c ?n2)
            (next ?n1 ?n2)
        )
        :effect (and
            (not(drone-free ?d))
            (drone-carry-box ?d ?b) ;el dron coge la caja, y
            (not(carrier-has-box ?c ?b)) ;el carrier ya no la tendrá
            (carrier-n-boxes ?c ?n1)
            (not(carrier-n-boxes ?c ?n2))
        )
    )
    
    (:action drop
        :parameters (?d - drone ?b - box ?c - content ?l - location ?h - human)
        :precondition (and 
            (drone-carry-box ?d ?b)
            (drone-at ?d ?l)
            (human-at ?h ?l)
            (box-has ?b ?c)
        )
        :effect (and
            (drone-free ?d)
            (box-at ?b ?l)
            (human-has ?h ?c)
            (not (drone-carry-box ?d ?b))
            (not (box-free ?b))
        )
    )
)

; problem
(define (problem drone_problem_d1_r1_l5_p5_c5_g5_ct2)
(:domain drone-dom)
(:objects
	drone1 - drone
	warehouse - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	box1 - box
	box2 - box
	box3 - box
	box4 - box
	box5 - box
	food - content
	meds - content
	human1 - human
	human2 - human
	human3 - human
	human4 - human
	human5 - human
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(carrier-at carrier1 warehouse)
	(carrier-n-boxes carrier1 n0)
	(drone-at drone1 warehouse)
	(drone-free drone1)
	(box-at box1 warehouse)
	(box-free box1)
	(box-at box2 warehouse)
	(box-free box2)
	(box-at box3 warehouse)
	(box-free box3)
	(box-at box4 warehouse)
	(box-free box4)
	(box-at box5 warehouse)
	(box-free box5)
	(box-has box1 food)
	(box-has box2 food)
	(box-has box3 food)
	(box-has box4 food)
	(box-has box5 meds)
	(human-at human1 loc4)
	(human-at human2 loc1)
	(human-at human3 loc4)
	(human-at human4 loc1)
	(human-at human5 loc2)
	(next n0 n1)
	(next n1 n2)
	(next n2 n3)
	(next n3 n4)
)

(:goal (and
	(drone-at drone1 warehouse)
	(carrier-at carrier1 warehouse)
	(human-has human1 food)
	(human-has human2 food)
	(human-has human3 food)
	(human-has human4 food)
	(human-has human5 meds)
	))
)

; plan
1. (pick-up drone1 box5 meds warehouse)
   deleted: (drone-free drone1) (box-at box5 warehouse)
   added: (drone-carry-box drone1 box5)
   goals met: 2 of 7
2. (move drone1 warehouse loc2)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc2)
   goals met: 1 of 7
3. (drop drone1 box5 meds loc2 human5)
   deleted: (drone-carry-box drone1 box5) (box-free box5)
   added: (drone-free drone1) (box-at box5 loc2) (human-has human5 meds)
   goals met: 2 of 7
4. (move drone1 loc2 warehouse)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 warehouse)
   goals met: 3 of 7
5. (pick-up drone1 box1 food warehouse)
   deleted: (drone-free drone1) (box-at box1 warehouse)
   added: (drone-carry-box drone1 box1)
   goals met: 3 of 7
6. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 2 of 7
7. (drop drone1 box1 food loc4 human1)
   deleted: (drone-carry-box drone1 box1) (box-free box1)
   added: (drone-free drone1) (box-at box1 loc4) (human-has human1 food)
   goals met: 3 of 7
8. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 4 of 7
9. (pick-up drone1 box3 food warehouse)
   deleted: (drone-free drone1) (box-at box3 warehouse)
   added: (drone-carry-box drone1 box3)
   goals met: 4 of 7
10. (move drone1 warehouse loc4)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc4)
   goals met: 3 of 7
11. (drop drone1 box3 food loc4 human3)
   deleted: (drone-carry-box drone1 box3) (box-free box3)
   added: (drone-free drone1) (box-at box3 loc4) (human-has human3 food)
   goals met: 4 of 7
12. (move drone1 loc4 warehouse)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 warehouse)
   goals met: 5 of 7
13. (pick-up drone1 box2 food warehouse)
   deleted: (drone-free drone1) (box-at box2 warehouse)
   added: (drone-carry-box drone1 box2)
   goals met: 5 of 7
14. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 4 of 7
15. (drop drone1 box2 food loc1 human2)
   deleted: (drone-carry-box drone1 box2) (box-free box2)
   added: (drone-free drone1) (box-at box2 loc1) (human-has human2 food)
   goals met: 5 of 7
16. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 6 of 7
17. (pick-up drone1 box4 food warehouse)
   deleted: (drone-free drone1) (box-at box4 warehouse)
   added: (drone-carry-box drone1 box4)
   goals met: 6 of 7
18. (move drone1 warehouse loc1)
   deleted: (drone-at drone1 warehouse)
   added: (drone-at drone1 loc1)
   goals met: 5 of 7
19. (drop drone1 box4 food loc1 human4)
   deleted: (drone-carry-box drone1 box4) (box-free box4)
   added: (drone-free drone1) (box-at box4 loc1) (human-has human4 food)
   goals met: 6 of 7
20. (move drone1 loc1 warehouse)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 warehouse)
   goals met: 7 of 7
